[
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/(팀명)_개발기획서.pdf",
    "page_number": 1,
    "chunk_in_page": 0,
    "text_for_embedding": "소프웨어개발보안경진대회 개발기획서\n\n[TABLE 요약]: 이 표는 기술 개발 프로젝트의 지원 및 제출 가이드라인을 설명하는 템플릿으로, 크게 두 가지 트랙(기술혁신성/공공활용성)과 필수 작성 항목(팀명, 개발언어, 프로젝트 명 및 소개, 팀 소개)을 정의합니다. 핵심 내용을 보면, 개발언어는 Java 또는 Python 중 선택이 의무이며, 프로젝트 소개 및 팀원 역할은 개인정보 노출 없이 각각 3줄 이내로 간략히 작성해야 합니다. 표는 참가자에게 체계적인 정보 제공을 요구하는 공모전 또는 해커톤 형식의 행사 구조를 반영하고 있으며, 엄격한 형식 준수(예: colspan 활용)가 특징인 공식 문서 양식임을 나타냅니다. 수치적 데이터는 없으나, 간결한 작성 요건과 트랙별 분류 체계가 주요 강조점입니다.\n\n<작성 안내사항> - 모든 기재 내용에는 허위 사실이 없어야하며, 필요시 증빙 내용을 제출해야 함 - 글자는 12포인트로 작성하며 분량의 제한은 없음 - 서류심사시 개발기획서를 기반으로 평가 - 팀명은 참가신청서에 작성한 팀명과 동일해야 함\n\n① 추진 배경 및 필요성 [작성비중 : 20%)\n\n기획 의도의 목적이 명확한가, 기존 서비스와 비교하여 독창적인 특징이 있는가? 등 작성",
    "summary": "소프웨어개발보안경진대회 개발기획서는 기술혁신성/공공활용성 두 트랙으로 나뉘며, 팀명, 개발언어(Java/Python 필수), 프로젝트 소개(3줄 이내) 등을 포함해야 한다. 작성 시 허위 내용 없이 간결하게 기술해야 하며, 서류심사 시 개발기획서가 주요 평가 기준이 된다. 추진 배경 및 필요성(20%)은 독창성과 기존 서비스 대비 차별성을 명확히 해야 한다.",
    "point_id": 1
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/(팀명)_개발기획서.pdf",
    "page_number": 2,
    "chunk_in_page": 0,
    "text_for_embedding": "2 주요 기능 및 개발환경 [작성비중 : 50%)\n\n구현서비스의 기능이 명확하게 정의되었는가? 기능을 구현하기 위해 서술한 개발환경이 적절한가? 등 작성 ex)개발 플랫폼, 언어, API 등 작성 * 상세 기능구성도 필수작성(시스템 아키텍처 포함. 아래 이미지는 예시이며, 참고해서 작성)\n\nApplication Events ○ Systems of Record Write Systems of aws Record Region Event Bus Amazon EventBridge File System Changes Async Write Ingestion Logic File Systems Amazon S3 AWS Storage Events Gateway 오 LogicLayer 串 Database Changes Machine Sync Serverless Long Running Saga Pattern Write Learning Microservices Containers CDC Event Stream AWS Step Amazon A21 DB CDC Events AWS Lambda AWS Fargate Functions Amazon-Kinesis AWS DMS Data DataLayer Events Users Path-based Latency REST/SOAP Query Single View Report DB Data Lake Routing Routing Amazon-AP1- Amazon Amazon S3 Amazon- Gateway Aurora Lake Formation Amazon- Amazon DynamoDS CloudFront Route 53 CQRS Cross-Region Cross·Region Cross-Region Write Replication Replication Replication Global Tables Global Database S3CRR REST/SOAP Query Amazon- API- Gateway Data Lake Amazon- Amazon Amazon S3 DynamoDB Aurora Lake Formation\n\n<아키텍처 예시>\n\n3 활용방안 및 기대효과 [작성비중 : 30%)\n\n대회주제에 적합한가? 기존 서비스의 문제점을 제시하고 개선사항을 도출하였는가? 등 작성",
    "summary": "주요 기능 및 개발환경을 명확히 정의하고 시스템 아키텍처 상세 구성도를 포함해야 하며, 개발 플랫폼, 언어, API 등을 상세히 작성해야 함.  \n대회 주제에 적합한 활용방안과 기대효과를 제시하고, 기존 서비스 문제점 및 개선방안을 도출해야 함.  \nApplication Events, Systems of Record, AWS 서비스 등을 활용한 이벤트 기반 아키텍처와 데이터 처리 방식을 구현해야 함.",
    "point_id": 2
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/[사람인] 교육,강사 이력서(워드).docx",
    "page_number": 1,
    "chunk_in_page": 0,
    "text_for_embedding": "사람인 - Saramin\n\n· 생년월일 1987 년 01 월 01 일 (만 00 세)\n\n· 이메일 email@email.com\n\n· 연락처 010-0000-0000\n\n· 주소\n\n서울특별시 구로구 구로동 코오롱싸이언스밸리 00\n\n· 보훈여부 ☑대상 ☑비대상\n\n· 병역여부\n\n☑군필(기간/계급/병과) □미필 □면제(사유)\n\n학력사항\n\n· 20.01-20.01 。 。 고등학교 졸업 전공 / 소재지 · 20.01-20.01 。 。 대학교 졸업 전공 / 소재지 / 학점 · 20.01-20.01 。 ○대학원 석사 졸업 (또는 사이버대, 학점은행제) 전공 / 소재지 / 학점\n\n경력사항\n\n방과후 교사 / 2000.01-2001.01(1 년 1 개월)\n\n- 상세업무 서술\n\n· 。 ○학원 강사 / 2000.01-2001.01(1 년 1 개월) - 상세업무 서술\n\n· 。 ○학교 기간제 교사 / 2000.01-2001.01(3 개월) - 담당과목 및 상세업무\n\n직무관련 자격증\n\n· 00.01-01.01 / 청소년 지도사 / 교육기관 · 00.01-01.01 / 직무관련 교육 / 교육기관 · 00.02 / 워드프로세서 1 급 / 발급기관 · 00.02 / 사무자동화 / 발급기관\n\n외국어\n\n· 2000.02 / 어학자격증 점수(토익 600) / 발급기관 · 2000.02 / HSK 2 급 / 발급기관 · 2000.02 / JPT 800 / 발급기관",
    "summary": "1987년생 지원자의 이력서로, 학력, 방과후 교사 및 학원 강사 경력, 청소년 지도사 등 자격증 및 외국어 능력 정보가 포함되어 있습니다.  \n주소, 연락처, 보훈/병역 여부와 함께 고등학교, 대학교, 대학원 졸업 정보가 기재되어 있습니다.  \n경력사항과 자격증, 외국어 시험 점수를 통해 교육 및 사무 관련 직무 역량을 강조하고 있습니다.",
    "point_id": 3
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/[사람인] 교육,강사 이력서(워드).docx",
    "page_number": 2,
    "chunk_in_page": 0,
    "text_for_embedding": "제목(ex.성격의 장단점, 지원동기···)\n\n자기소개서를 입력하세요.",
    "summary": "- 제목을 성격에 관한 내용, 지원 동기 등으로 명확히 구분하여 기재  \n- 자기소개서에 본인의 핵심 역량과 회사에 기여할 수 있는 점을 구체적으로 서술  \n- 간결하면서도 진정성 있는 표현으로 구성  \n\n(※ 실제 텍스트가 비어 있어 일반적인 자기소개서 작성 가이드라인으로 대체 작성)",
    "point_id": 4
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/[사람인] 교육,강사 이력서(워드).docx",
    "page_number": 3,
    "chunk_in_page": 0,
    "text_for_embedding": "제목(ex.성장과정)\n\n자기소개를 입력하세요.\n\n제목(ex.성격의 장단점, 지원동기···)\n\n자기소개를 입력하세요.\n\n제목(ex.성격의 장단점, 지원동기···)\n\n자기소개를 입력하세요.\n\n제목(ex.입사 후 포부)\n\n자기소개를 입력하세요.",
    "summary": "이 텍스트는 자기소개서의 다양한 항목(성장과정, 성격의 장단점, 지원동기, 입사 후 포부 등)에 대한 입력 양식을 나열한 것이다. 각 항목은 제목과 내용을 입력할 수 있는 구조로 구성되어 있다. 동일한 형식이 반복되어 여러 항목에 대한 자기소개 작성이 가능함을 보여준다.",
    "point_id": 5
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/블록체인논문.pdf",
    "page_number": 1,
    "chunk_in_page": 0,
    "text_for_embedding": "블록체인 기반 전자투표 시스템의 기술 동향 및 보안성 분석\n\n김광원\n\n요약\n\n전자투표 시스템은 수기 방식에 비해 투표 접근성과 효율성을 높이고, 자원과 비용 절감 목적으로 개발되었다. 특히 중앙집중형 전자투표 시스템은 투표율 제고에는 기여하나, 데이터 위 변조, 해킹 등의 보안 취약점으로 인해 널리 채택되지 못하고 있다. 이에 따라 블록체인 기술이 데이터 무결성과 투표 과정의 투명성 확보 측면 에서 유망한 대안으로 주목받고 있다. 본 논문에서는 블록체인 기술을 기반으로 한 전자투표 시스템의 기술의 동향과 보안성을 중심으로 분석해보고자 한다.\n\nA Study on Technological Trends and Security Analysis of Blockchain-Based Electronic Voting System\n\nKim Gwang-won\n\nABSTRACT\n\nThe electronic voting system was developed to improve voting accessibility and efficiency compared to handwritten methods, while also reducing resources and costs. Although centralized electronic voting systems have contributed to increasing voter turnout, they have not been widely adopted due to security vulnerabilities such as data tampering and hacking. As a result, blockchain technology has emerged as a promising alternative for ensuring data integrity and transparency in the voting process. This paper analyzes the technological trends and security aspects of electronic voting systems based on blockchain technology.\n\n1. 서론\n\n한국의 공직 선거는 75 년 전부터 지금까지 종이투표 방식으로 진행됐다. 이러한 투표 방식은 사람이 직접 확인하고 개표하기 때문에 오류의 가능성을 배제할 수 없다. 한편 동유럽 국가의 에스토니아는 2007 년 부터 세계 최초로 전자투표를 도입했다[1]. 이외에도 스페인의 경우도 2015 년 부터 블록체인 기술을 이 용한 투표 방식인·아고라 보팅(Agora voting)' 시스템 을 도입했다[2]. 블록체인 기술은 중앙기관 없이도 거래 내역을 투명하게 기록하고 위변조를 방지할 수\n\n있다. 모든 데이터는 다수의 노드에 의해 공유되고 암호화되어 저장되므로 하나의 노드가 해킹 당하더 라도 전체 시스템에 미치는 영향은 제한적이다. 또한 공개적으로 검증이 가능하다는 점에서 투명성, 신뢰 성을 강화할 수 있다. 선거를 하기 위해서는 선거의 4 원칙인 직접, 보통, 평등, 비밀 선거가 철저하게 지켜 져야 한다. 전자투표의 경우에도 안전과 관련한 요구 사항이 지켜져야 한다.[3]\n\n1.완전성 : 투표는 시작부터 종료까지 완전하게 이루 어지고 정확하게 집계되어야 한다",
    "summary": "블록체인 기반 전자투표 시스템은 중앙집중형 시스템의 보안 취약점을 해결하며 데이터 무결성과 투명성을 강화한다. 기존 전자투표 시스템은 해킹과 위변조 위험으로 널리 채택되지 못했으나, 블록체인 기술은 분산 저장과 암호화로 보안을 개선한다. 이를 통해 선거의 핵심 원칙인 완전성, 직접성, 비밀보장 등을 충족할 수 있는 가능성이 분석된다.",
    "point_id": 6
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/블록체인논문.pdf",
    "page_number": 2,
    "chunk_in_page": 0,
    "text_for_embedding": "2.개인화 : 투표자가 누구인지, 그내용을 알 수 없도 록 비밀이 지켜져야함\n\n3. 이중투표불가성 : 투표자는 한번만 투표 가능\n\n4. 선거권 : 투표 자격이 있는 유권자만 투표 가능\n\n5. 공정성 : 투표 집계를 도중에 알수 있게 하여, 남겨 진 투표에 어떤 영향도 주어서는 안됨\n\n6. 검증성 : 자신의 투표 확인가능, 어느 누구도 투표 결과 조작 불가능\n\n블록체인 기반 전자 투표 시스템의 대부분은 위 원칙 들을 지키기 위해 스마트 컨트랙트를 이용한다. 본론 에서는 블록체인 기반 전자 투표 시스템들의 관한 연 구들의 내용과 주요 보안 위협들을 살펴 보며 안전성 및 대응 방안에 대해서 분석하고자 한다.\n\n2. 배경지식\n\n2-1 블록체인\n\n블록체인은 데이터를 저장한 블록들이 체인형태로 이루어져 있는 분산 데이터 저장 환경이다. 수정이 불가능하며, 누구나 열람할 수 있다. 현재 비트코인, 이더리움 등의 여러 코인들은 블록체인 기술이 적용 된 코인들로 탈중앙 형태로 각각 설정된 합의 알고리 즘을 통해 블록이 선정되고 해당 블록이 선정되면 블 록의 소유주는 보상으로 코인을 얻을 수 있다. 종류 로는 크게 Public, Private 으로 나눌 수 있으며 이는 참여자의 형태에 따라 구분된다. 이 둘을 합친 블록 체인 형태를 Hybrid 블록체인이라고 부른다 [4].\n\n2-2 스마트 계약\n\n1994 년 닉 자보에 의해 처음 제안되었고, 블록체인 기반으로 금융거래, 부동산 계약 등의 모든 종류의 계약을 체결하고 이를 수행한다. 비탈릭 부테린은 이\n\n더리움이라는 가상화폐를 만들고 이를 이용해 스마 트 계약 기능을 구현하였다. 에스크로 기능이 필요하 지 않아 중개 수수료가 절감 되고, 코드를 통해 계약 조건을 명시하기에 비용 효율적이다. 대부분의 스마 트계약은 이더리움을 이용하며, 솔리디티라는 튜링 완전 언어를 사용해 구현한다.\n\n3. 연구 분석\n\n블록체인 기반의 연구들은 더 효율적인 방법을 찾기 위해 국내외로 계속해서 진행중이다. 해당 장에서는 어떤 방식으로의 연구가 진행중인지 파악해 보도록 한다.\n\nelection vote voter miner administrator Contract candidates, term, voter registration election Start paid gas vote management certify vote verification voting election Finish vote counting\n\nfig. 1\n\nfig. 1 은 [3]의 투표 절차이다. 블록체인 기반 전자투 표 시스템 구축에 관한 논문[3]에서는 투표관리자와 유권자의 역할을 나눈다. 투표관리자는 선거와 관련 된 정보, 유권자 정보등을 등록하며, 선거를 시작 종 료, 투표 집계하는 역할을 한다. 유권자는 자신을 인 증하고 gas 를 지급받아 투표를 진행한다. 스마트 컨 트랙트는 솔리디티를 이용하였고, 투표자의 개인키 로 사인하기 위해 MetaMask 의 Wallet 을 사용하였 다. 투표는 투표 시작, 트랜잭션, 마이닝, 블록 생성, 투표 종료 총 5 단계를 거쳐 진행된다.",
    "summary": "1. 블록체인 기반 전자 투표 시스템은 개인화, 이중투표불가성, 선거권, 공정성, 검증성 등 투표 원칙을 지키기 위해 스마트 컨트랙트를 활용한다.  \n2. 블록체인은 분산 저장 및 수정 불가능 특성으로 투명성을 제공하며, 스마트 컨트랙트는 계약 자동화를 통해 중개 비용을 절감한다.  \n3. 연구 분석에서는 투표 절차(등록, 인증, 트랜잭션, 마이닝, 집계)와 보안 위협을 분석하며 이더리움 및 솔리디티를 주요 기술로 활용한다.",
    "point_id": 7
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/블록체인논문.pdf",
    "page_number": 3,
    "chunk_in_page": 0,
    "text_for_embedding": "1.투표시작 : 선거관리위원의 key 등록후 해당 권한 에서 투표 개시, 유권자 사전에 등록, 투표 시작및 종 료시간 설정\n\n2. 트랜잭션 : 유권자는 투표할 대상 선택, Wallet 사 용해서 투표. 기한, 자격, 투표여부 확인 후 투표가능 이후 득표 및 유권자의 키와 결과 저장\n\n3.마이닝 : 블록체인에 기록하기 위한 작업\n\n4.블록 생성 : 거래 승인된 블록은 블록체인에 연결\n\n5.투표종료 : 선거관리 위원만 결과 열람가능. 유권 자는 자신의 투표 조회 가능.\n\nVoting System Sequence\n\nAuthentication Tally Voter Blockchain Blockchain Key Request Generate Key Return Key [Key, Vote Value] Key Validation Request Check Key Hash Validation Result Validation Result Tallying Vote Value\n\nfig.2\n\n다른 제안된 논문[4]에서는 BaaS 를 이용하여 하이 브리드 블록체인 기반의 전자투표 시스템을 설명하 였다. fig. 2 는 [4]에서 설명하는 투표 시스템의 흐름 도이다. 투표자, 인증 블록체인, 집계 블록체인으로 구성되고 인증 블록체인은 프라이빗 환경에서 투표 자에게 인증키를 발급하며 투표자는 발급받은 키를 통해 퍼블릭 블록체인인 집계 블록체인에서 투표를 할 수 있다. 집계 블록체인은 투표 값을 받아 집계를 수행한다. 프라이빗 블록체인은 하이퍼레저 패브릭 블록체인을 사용하였고, 퍼블릭 블록체인으로는 이\n\n더리움의 확장성 문제를 해결하기 위해 폴리곤 블록 체인을 사용한다. 또한 BaaS 사용한 결과 일반적인 시스템 대비 gas 사용량도 낮게 나온 것을 설명하였 다.\n\n:Election Blockchain :Master Node Voter Committee a. Define voting agenda b. Voter registration c. Generate ballot (Define Token) d. Distribution ofballots e. Vote f. Vote counting g- Check the voting result\n\nfig.3\n\n익명성을 더욱 보완하기 위한 논문[5]에서는 소규모 네트워크에서도 보다 강력한 익명성을 보장하기 위 한 방안을 제시하였다. fig.3 은 [5]의 흐름도이다.기 본적으로 비대칭키 암호화를 활용하여 투표자와 마 스터 노드간의 투표 정보를 처리한다. 또한 투표 중 발생할 수 있는 부하 균형 문제 편중된 투표 문제 등 이 발생함을 알리며 그것들의 해결방안에 대해 제시 하며 블록체인에서 익명성을 높이는 방법을 설명한 다. 또 다른 논문[6]에서는 교내에서의 투표 상황에 관하여 연구를 진행하였다. 기존의 DB 를 이용하\n\n여 투표자 인증을 통해 랜덤한 Seed 를 생성한다. 이 를 기반으로 개인키와 공개키를 생성하고 유권자 정 보가 스마트 컨트랙트에 등록된다. 인증절차는 기존 의 DB 정보를 이용하고 투표는 퍼블릭 환경에서 진",
    "summary": "1. 블록체인 기반 전자투표 시스템은 프라이빗 블록체인으로 유권자 인증 및 키 발급, 퍼블릭 블록체인으로 투표 집계 및 저장을 수행한다.  \n2. BaaS(BaaS)와 하이브리드 블록체인(이더리움/폴리곤, 하이퍼레저 패브릭) 활용으로 가스 비용 절감 및 확장성 문제를 해결한다.  \n3. 익명성 강화를 위한 비대칭키 암호화, 부하 균형 방안 및 소규모 네트워크 적용 사례가 연구되었다.",
    "point_id": 8
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/블록체인논문.pdf",
    "page_number": 4,
    "chunk_in_page": 0,
    "text_for_embedding": "행이 된다. 이때 랜덤한 Seed 를 부여 했기 때문에 익 명성이 보장이 된다. 대부분 진행되는 연구는 이더리 움을 이용한다. 유권자 인증, 투표권 부여 등의 과정 을 스마트 컨트랙트를 사용하여 구현하였기 때문이 다.\n\n[TABLE 요약]: 이 표는 블록체인 기반 연구 사례를 개발 환경(이더리움)과 구현 방식(Private, Hybrid, Public)별로 분류한 데이터입니다. 총 4건의 연구 중 2건은 퍼블릭 블록체인, 1건은 프라이빗, 1건은 하이브리드 방식을 사용했으며, 모든 연구가 이더리움 플랫폼을 기반으로 수행되었음을 확인할 수 있습니다. 특히 퍼블릭 블록체인 구현 사례가 상대적으로 많아 개방성 중심의 연구가 활발했음을 시사합니다.  \n\n(참고: 각 행의 '[3]', '[4]' 등은 연구 출처를 나타내는 참조 번호입니다.)\n\ntable1\n\n[3]의 경우는 private 환경에서 연구를 진행 했지만 public 환경에서 사용을 가정하여 이더리움을 이용 하였다.\n\n4.안전성 평가\n\n[TABLE 요약]: 이 표는 4개의 연구([3]~[6])에서 평가한 정보 보안 속성(기밀성, 무결성, 가용성)의 수준을 비교한 것입니다. 주요 경향은 무결성이 모든 연구에서 '높음'으로 일관되게 강조되는 반면, 기밀성은 연구마다 '낮음'([3], [6])에서 '높음'([5])까지 편차가 크게 나타났습니다. 가용성은 [4]를 제외하고 대부분 '보통' 수준으로 분석되었습니다. 이를 통해 연구별로 보안 요구사항에 차이가 있음을 알 수 있습니다.\n\ntable2\n\n전자 투표는 비용적인 문제와 편의성 측면에서 수기 투표보다 많은 이점들을 가진다. 하지만 이러한 시스 템을 이용하기 위해서는 유권자들의 신뢰를 확보 하 여야 한다. 그렇기 때문에 어떤 공격에서 얼마나 안 전한지 등의 고려가 필요하다.\n\n[3] : 지갑주소 기반으로 유권자 식별 가능성 존재\n\n[4] : 대체로 강력한 보안 및 효율성 증명\n\n[5] : 체인 믹싱 및 마스터 노드 기반의 높은 익명성을 제공\n\n[6] :기존의 DB 기반으로하여 유권자 인증으로 인한 시스템 공격 취약 가능성 존재\n\n[TABLE 요약]: 이 표는 네 가지 연구([3]~[6])에서 제안된 블록체인 또는 분산 시스템 기반의 보안성 특징을 비교한 자료입니다. 주요 특징으로는 '무결성 확보'가 모든 연구에서 공통적으로 강조되었으며, 이중투표 방지([3]), 익명성 확보([5], [6]), 위변조 방지([6]) 등 추가적인 보안 메커니즘이 연구별로 차이를 보입니다. 특히 [6]은 무결성, 익명성, 위변조 방지를 모두 지원하며 가장 포괄적인 보안 프레임워크를 제안한 것으로 나타납니다. 표를 통해 각 연구의 보안 목표 중점과 기술적 범위를 명확히 비교할 수 있습니다.\n\ntable3\n\n5.결론",
    "summary": "블록체인 기반 전자 투표 연구는 대부분 이더리움을 사용하며, 스마트 컨트랙트로 유권자 인증 및 투표권 부여 과정을 구현한다.  \n퍼블릭 블록체인 구현 사례가 많고, 무결성은 모든 연구에서 높게 평가되나 기밀성과 가용성은 연구별로 차이가 있다.  \n익명성 보장, 이중투표 방지, 위변조 방지 등 보안 메커니즘은 연구마다 상이하게 적용된다.",
    "point_id": 9
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/블록체인논문.pdf",
    "page_number": 4,
    "chunk_in_page": 1,
    "text_for_embedding": "table3\n\n5.결론\n\n본 논문은 블록체인 기반 전자투표 시스템이 어떠한 방식으로 연구가 진행중인지 동향과 보안성을 분석 하였다. 기존 전자투표 시스템이 가지고 있던 중앙 집중 구조의 한계를 극복하기 위해 블록체인이 적용 되고 있으며 이는 무결성과투명성, 신뢰성을 강화하 는 유력한 대안이 될 수 있다. 블록체인의 분산 원장 구조는 선거의 공정성과 결과의 불변성을 보장할 수 있다는 점에서 주목할 만하다. 각 연구들을 비교한 결과, 각 시스템은 구현 목적과 환경에 따라 상이한 보안 특성을 보였다. CIA 보안 삼원칙을 기준으로 살 펴볼 때, 무결성은 대부분의 시스템이 블록체인의 불 변성 덕분에 충분히 확보되고 있으며, 가용성은 BaaS 기반의 하이브리드 시스템에서 가장 뛰어난 것 으로 분석되었다. 반면. 기밀성은 설계 구조에 따라 편차가 컸으며, 이를 보완하기 위한 기술적 접근이 향후 핵심 과제가 될 것이다. 결론적으로 블록체인 기반 전자투표는 기술적, 행정적 개선이 병행된다면 기존 투표 시스템의 한계를 극복하고 안전하고 신뢰 할수 있는 새로운 투표 방식으로 자리잡을 수 있다. 향후에는 블록체인의 효율성, 확장성, 그리고 사용 자 친화적인 인터페이스 설계와 더불어, 법 제도적 정비와 시범 사업을 통한 실효성 검증이 중요할 것이",
    "summary": "블록체인 기반 전자투표 시스템은 중앙 집중식 한계를 극복하고 무결성·투명성·신뢰성 강화에 효과적이며, CIA 보안 삼원칙 중 무결성과 가용성은 우수한 반면 기밀성은 보완이 필요하다. 분산 원장 구조를 통해 선거 공정성과 결과 불변성을 보장할 수 있으며, 기술적·행정적 개선과 법 제도적 정비가 병행된다면 안전하고 신뢰할 수 있는 투표 시스템으로 발전 가능하다. 향후 효율성, 확장성, 사용자 친화적 인터페이스 및 실효성 검증이 핵심 과제이다.",
    "point_id": 10
  },
  {
    "doc_id": "/Users/gwangwon/Desktop/ㅇㅇ/dummy/블록체인논문.pdf",
    "page_number": 5,
    "chunk_in_page": 0,
    "text_for_embedding": "다. 또한 선거 규모와 목적에 따른 맞춤형 시스템 설 계와 함께, 다양한 블록체인 플랫폼의 특성과 보안성 비교를 통해 최적의 기술 조합을 찾는 실증적 연구도 지속되어야 한다.\n\nReferences\n\n[1] 박은주, \"[유권자의 날] 전자투표 본격 도입 위한 선행과제는 바로'보안'\" https://www.boannews.com/media/view.asp?idx=1 17909\n\n[2] 장정현, \"블록체인 투표 시스템 '아고라 보팅 (Agora Voting)' 도입한'스페인\" https://www.erc.re.kr/webzine/vol30/sub11-1.jsp\n\n[3] 이루다, 임좌상, \"블록체인을 활용한 전자투표 시스템 구축\"\n\n[4] 강명조, 김미희, \"BaaS 를 이용한 하이브리드 블 록체인 기반 전자투표 시스템\"\n\n[5] 조재한, 이이섭, 최창훈, \"마스터 노드 네트워크 를 사용한 블록체인 익명 투표 모델\"\n\n[6] 성기정, 정채린, 조은아, 이종호, 김희영, 김영우, 이경현, \"블록체인 기반 교내 전자투표 시스템\"",
    "summary": "선거 규모와 목적에 맞는 맞춤형 시스템 설계 및 블록체인 플랫폼 특성·보안성 비교를 통한 최적의 기술 조합 연구가 필요하다.  \n블록체인 기반 전자투표 시스템 구축 및 BaaS 활용 하이브리드 모델, 익명 투표 모델 등 관련 연구가 활발히 진행 중이다.  \n국내외 사례 분석을 통해 전자투표 도입을 위한 보안 및 기술적 과제 해결이 중요하다.",
    "point_id": 11
  }
]